{
  "authors": [
    {
      "_type": "author",
      "name": "Tushar Laad",
      "slug": {
        "_type": "slug",
        "current": "tushar-laad"
      },
      "bio": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Data Engineer & Software Architect passionate about building innovative solutions and data systems."
            }
          ]
        }
      ]
    }
  ],
  "projects": [
    {
      "_type": "project",
      "title": "NLP and LLM Driven Identification of Job Intent, Technologies, and Teams",
      "shortTitle": "Job Matching AI",
      "slug": {
        "_type": "slug",
        "current": "nlp-llm-job-matching"
      },
      "subTitle": "Research project on semantic job matching",
      "client": "Newcastle University",
      "links": [],
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "The process of matching job seekers with suitable job opportunities is a critical task in the recruitment industry. However, the complexity and variability of job descriptions often pose challenges in accurately identifying the job intent, required technologies, and team structures."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "This research project aims to develop an NLP and LLM based platform that can analyze job descriptions and extract relevant information, thereby enhancing the job matching process. By leveraging Natural Language Processing (NLP) techniques and Large Language Models (LLMs), the proposed platform enables a more semantic understanding of job descriptions and candidate profiles."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Key Objectives"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "• Scraping and preprocessing job descriptions\n• Generating a comprehensive dictionary of job intents, technologies, and teams\n• Labeling job descriptions using the generated dictionary and NLP techniques\n• Evaluating and comparing the performance of various NLP and LLM models for identifying job intent\n• Developing an ETL pipeline for data processing\n• Implementing a prototype API for ingesting job descriptions and retrieving job opportunities based on intent, technology, and team"
            }
          ]
        }
      ],
      "color1": {
        "_type": "color",
        "hex": "#00d4ff"
      }
    },
    {
      "_type": "project",
      "title": "End to End Encrypted Chat App on React.js + Firebase",
      "shortTitle": "Decipher Chat",
      "slug": {
        "_type": "slug",
        "current": "encrypted-chat-app"
      },
      "subTitle": "Secure messaging with end-to-end encryption",
      "client": "Newcastle University",
      "links": [
        {
          "_type": "link",
          "text": "Live Demo",
          "url": "https://decipher.website"
        },
        {
          "_type": "link",
          "text": "GitHub",
          "url": "https://github.com/laadtushar/end-to-end-encrypted-chat-app"
        },
        {
          "_type": "link",
          "text": "Demo Video",
          "url": "https://www.youtube.com/watch?v=gqsp-OPTtIk"
        }
      ],
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "A secure chat application featuring end-to-end encryption built with React.js and Firebase, demonstrating advanced security concepts including asymmetric encryption for scalable web applications."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Technical Implementation"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Implemented end-to-end encryption with public/private key architecture. Public keys are stored on servers while private keys remain on local devices, providing an additional layer of security requiring users to authenticate with their private keys upon logging in from any device."
            }
          ]
        }
      ],
      "color1": {
        "_type": "color",
        "hex": "#8b5cf6"
      }
    },
    {
      "_type": "project",
      "title": "XpenseLab",
      "shortTitle": "XpenseLab",
      "slug": {
        "_type": "slug",
        "current": "xpenselab"
      },
      "subTitle": "Personal budgeting tool",
      "client": "Personal Project",
      "links": [
        {
          "_type": "link",
          "text": "Visit Site",
          "url": "https://XpenseLab.com"
        }
      ],
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "A personal budgeting tool built with Firebase and Google Data Studio for expense tracking and financial visualization. Features real-time expense monitoring with Cloud Firestore backend."
            }
          ]
        }
      ],
      "color1": {
        "_type": "color",
        "hex": "#f59e0b"
      }
    },
    {
      "_type": "project",
      "title": "Vail Perfumes E-commerce",
      "shortTitle": "Vail Perfumes",
      "slug": {
        "_type": "slug",
        "current": "vail-perfumes"
      },
      "subTitle": "E-commerce store for perfumes",
      "client": "Vail Perfumes",
      "links": [
        {
          "_type": "link",
          "text": "Visit Store",
          "url": "https://vailperfumes.com"
        }
      ],
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Developed an e-commerce website with full WooCommerce functionality including product catalog, inventory management, payment gateway integration, and order management system."
            }
          ]
        }
      ],
      "color1": {
        "_type": "color",
        "hex": "#ec4899"
      }
    }
  ],
  "posts": [
    {
      "_type": "post",
      "title": "Choosing Innovation Over Safety: What My Journey With Appsatile Taught Me About Risk, Research, and the Future of Indian Tech",
      "slug": {
        "_type": "slug",
        "current": "choosing-innovation-over-safety"
      },
      "publishedAt": "2024-11-14T08:25:00.000Z",
      "linkedinUrl": "https://www.linkedin.com/pulse/choosing-innovation-over-safety-what-my-journey-appsatile-tushar-laad-xg2be",
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Growing up in India, I was raised with a very familiar message: play it safe. Study hard, get more degrees, secure a stable job in a reputable company, and build a predictable life. In many families—including mine—success was defined by safety, not by experimentation. The idea of taking risks, betting on uncertain ideas, or joining a young startup was often seen as unnecessary \"adventure\"."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "But from very early on, I felt pulled in a different direction."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "I've always been fascinated by innovation, by solving problems no one has solved before, by building something that doesn't exist yet. Not because it guaranteed money or success—most innovative startups fail—but because of the thrill of research, creation, and genuine impact. That curiosity eventually led me to Appsatile, and it has shaped how I view work, technology, and India's evolving tech culture."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "What I Observed in India's Tech Landscape"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Many of India's largest and most respected tech companies—TCS, Infosys, Wipro—are powerhouses in the service industry. They execute brilliantly, they scale reliably, and they deliver global value. But they are service-based at their core. They optimise more than they invent."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Meanwhile, in the US, the giants—Google, Apple, NVIDIA, Tesla—built their empires through heavy investment in research, bold risks, and a culture where failure is seen as part of the process, not something to fear."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "India is changing, of course. A newer wave of startups like Ather, Zomato, Lenskart, Zepto, and Skyroot are proving that innovation is possible here—and not just possible but scalable. But culturally, many young people are still encouraged to follow the safest path, not the most creative one."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "And I don't say this to criticise. I say it because I lived it."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "When Playing It Safe Feels Like the Only Option"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "In my family, and in many middle-class families, the priority was stability. Pursue qualifications that guarantee employability. Choose known paths. Don't take risks that could \"set you back\"."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "That mindset comes from a place of protection, not limitation—but it can also suppress a generation's potential for innovation."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Because innovation is not safe. Research is not predictable. And progress cannot be built by repeating what's already been done."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "What Appsatile Changed For Me"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Joining Appsatile has been the opposite of everything I was taught. It's raw, messy, experimental, unpredictable—and exactly the environment where deep learning happens. Nothing is handed to you. You build, you break, you rebuild, you rethink. You question assumptions. You push boundaries."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "It's not about salaries or titles. It's about solving real problems. It's about creating tools that didn't exist last week. It's about transforming ideas into systems, even if they fail the first five times."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "And that's the part of Indian tech culture I want to see more of."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Why India Needs More Research, More Risk-Takers, More Builders"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "India has brilliant minds. We have world-class engineers. We have ambition. What we often lack is the encouragement to take risks early, to explore research roles, to innovate without being punished for failure."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "If we want to see Indian tech produce the next global product giants—not just service giants—then we have to shift our mindset:"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "Encourage young people to experiment"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "Normalise failure as part of learning"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "Invest more in R&D, not just execution"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "Support early-stage startups doing deep tech"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "Celebrate problem-solving, not just job security"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "The real value for the next generation lies in innovation, not in playing safe."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "My Message to Anyone Who Feels the Same"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "If you feel drawn to building, exploring, and solving impossible problems—follow it. Even if it breaks tradition. Even if people don't understand. Even if the path feels uncertain."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Because the world doesn't change through safety."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "It changes because someone chooses to take a risk."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "And I'm glad I chose that path—even when everything around me said not to."
            }
          ]
        }
      ]
    },
    {
      "_type": "post",
      "title": "POV: You Work 16 Hours a Day While All Your Friends Enjoy Their 20s",
      "slug": {
        "_type": "slug",
        "current": "working-16-hours-while-friends-enjoy-20s"
      },
      "publishedAt": "2022-09-25T19:15:00.000Z",
      "linkedinUrl": "https://www.linkedin.com/pulse/pov-you-work-16-hours-day-while-all-your-friends-enjoy-tushar-laad",
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "I won't lie; I am incredibly jealous of all my classmates who are enjoying their lives, partying, or taking trips & vacations. Those Instagram stories that pop up every day are frustrating."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "What did I do not to deserve that fun? Am I losing my prime years to work? Why can't I go out clubbing every day? These questions cloud my mind at the end of a productive day at work. I have talked to a few trusted people about this, and they all agree that I should have a life. I am 20, and I am overworking. But I dismiss them by saying, \"It's my hustle to do, and it will all be worth it one day.\""
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "\"It will all be worth it one day\" that's what I keep telling myself, but I would be lying if I said I believe in that shit. I don't know the future; maybe I will regret not enjoying my early 20s; maybe at the end of the day we all will be standing on the same boat, and I wouldn't have achieved anything extra."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "In order to understand why I have a 16-hour work life, Let me give you a quick insight into a day in my life. I wake up at 6:15 AM, get ready, and reach college by 7:15 AM. I sign into the office (remote work) at 7:30 AM and work until my first lecture; after that, I keep switching between work and college until 6:30 PM, after which I leave for home and reach by 7:00 PM. I haven't signed out of the office yet because I still have a lot of work and have not completed my daily working hours. So I work until 8:30 or 9:00 PM, after which I have dinner. Before I sleep, I finish some work for clients I have taken up in my startup (Build My Site). After this, I go to bed by 10:30 PM. The last thing I do at night is, scroll some reels on Instagram, listen to some songs and feel sad about my pathetic social life."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "You would ask what keeps me going and what's stopping me from giving up on everything and just sleeping for a week at least."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Let me tell you a story; I choose weekends to fix my sleep schedule by continuously sleeping for 16-18 hours. The other weekend I was asleep for the last 12 hours during the day, and I was about to wake up when I heard my father ask my mother, \"Why is he sleeping during the day?\" My mother said, \"Let him sleep; he works hard the whole week.\" There's your answer. My mom knows I work hard, and that's all I need to keep going."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "My mother is the earning member of the family - I have seen her take up enormous responsibilities that any Indian woman needs to take up while also earning for the whole family and getting food on the table. I am probably just trying to be like her, and maybe one day, I will be able to give her the life of comfort that she has always ensured for me."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "So apart from the fact that I was bullied my whole childhood and I have a pathological need to prove to others that I am better than them and that you can't bully me anymore, It's the urge to make my mother proud that helps me keep the hustle up."
            }
          ]
        }
      ]
    },
    {
      "_type": "post",
      "title": "The \"Corporate Robot\" Paradox: Why Loving Your Job Is Both a Privilege and a Risk",
      "slug": {
        "_type": "slug",
        "current": "corporate-robot-paradox"
      },
      "publishedAt": "2026-01-15T07:31:00.000Z",
      "linkedinUrl": "https://www.linkedin.com/pulse/corporate-robot-paradox-why-loving-your-job-both-privilege-laad-zssoe",
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Scroll through LinkedIn for five minutes, and you will inevitably see it: the advice to \"escape the rat race,\" stop being a \"corporate robot,\" and prioritize \"living\" over working."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "It's a popular sentiment, but it always makes me pause."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "I am in a fortunate, perhaps statistical minority: "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "I am genuinely passionate about my work."
            },
            {
              "_type": "span",
              "text": " While money is obviously important for survival, it is secondary to the intrinsic fulfillment I get from what I do every day."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "But when I hear people reject the \"grind,\" I don't judge them. I realize we are looking at the same workplace reality through entirely different lenses."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Critically thinking about this divide requires us to move beyond anecdotal opinions and look at the psychology and economics of why we work. Why do some of us feel like excited contributors, while others feel like cogs in a machine?"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Here is what the research says about the tension between passion and paychecks."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "1. The Reality of Survival (Maslow's Hierarchy)"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "The criticism of the \"corporate robot\" often comes from a place of relative stability. To worry about \"passion,\" your basic needs must first be met."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "We cannot ignore "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "Maslow's Hierarchy of Needs"
            },
            {
              "_type": "span",
              "text": ". At the base of the pyramid are physiological needs (food, shelter) and safety."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "In an economic climate where wages often lag behind the cost of living, millions are stuck at these bottom levels. For them, a job isn't a platform for \"self-actualization\"; it is a survival mechanism. When you are working just to keep the lights on, \"passion\" is a luxury. In that context, \"acting like a robot\" is often a necessary form of mental self-preservation."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "2. The Psychology of Engagement (Self-Determination Theory)"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Why do I feel passionate while others feel like robots? Psychologists Edward Deci and Richard Ryan explain this through "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "Self-Determination Theory (SDT)"
            },
            {
              "_type": "span",
              "text": "."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "They argue that for humans to feel truly motivated, three basic psychological needs must be met: "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "Autonomy, Competence, and Relatedness."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "If your work provides these, you experience "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "intrinsic motivation"
            },
            {
              "_type": "span",
              "text": ". You don't need a \"boss\" to push you because the work itself is rewarding."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "The \"corporate robot\" phenomenon occurs in environments devoid of these elements. When you are micromanaged (no autonomy) and isolated (no relatedness), you rely solely on "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "extrinsic motivation"
            },
            {
              "_type": "span",
              "text": "—the paycheck. You aren't a robot; you are just reacting normally to a dehumanizing environment."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "3. The Founder's Dilemma: Mission vs. Sacrifice"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "There is another side to this conversation that often gets ugly: the shaming of the \"grinders.\""
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Startup founders and high-achievers are often criticized for sacrificing family time, sleep, and \"life\" for their vision. Critics call this \"toxic hustle culture.\" While it is true that burnout is a real health crisis, we must also look at "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "Social Identity Theory"
            },
            {
              "_type": "span",
              "text": "."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "For many founders, their mission isn't just a \"job\"—it is their primary identity. When someone is obsessed with solving a problem or building something new, the traditional definition of \"work-life balance\" feels like a constraint rather than a goal."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Shaming these individuals often ignores the fact that "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "innovation frequently requires obsession."
            },
            {
              "_type": "span",
              "text": " The tragedy isn't that some people work 80 hours a week; the tragedy is when people feel forced to work 80 hours a week for a cause they don't believe in. If the sacrifice is voluntary and driven by a deep sense of purpose, is it still \"toxic\"?"
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "4. Finding the Sweet Spot (Ikigai)"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "My experience aligns with the Japanese concept of "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "Ikigai"
            },
            {
              "_type": "span",
              "text": ", which translates to \"a reason for being.\" It suggests that professional fulfillment is found at the intersection of four circles:"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "What you love."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "What you are good at."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "What the world needs."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "listItem": "bullet",
          "children": [
            {
              "_type": "span",
              "text": "What you can be paid for."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Finding a role that hits all four is rare. Many people spend their lives working only in the \"what you can be paid for\" circle. I recognize that landing in the center is a significant advantage, not a standard everyone can easily reach."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "The Critical Twist: The Passion Tax"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "While being passionate is wonderful, critical thinking requires us to look at the downsides, too."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "If you love your work, beware the "
            },
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "\"Passion Tax.\""
            },
            {
              "_type": "span",
              "text": " Research published in the Journal of Personality and Social Psychology found that it is often viewed as more socially acceptable to exploit passionate workers."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Managers (and sometimes workers themselves) may believe that because you love what you do, you should be willing to tolerate poorer conditions. The \"don't be a robot\" crowd is sometimes right—they are setting boundaries that passionate people often struggle to maintain."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Conclusion"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "I love my work, and I am grateful for that every day. But I refuse to look down on those who view their jobs purely as a transaction, and I refuse to shame those who choose to give everything to their mission."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "We need to stop framing this as a moral battle between the \"enlightened passionate,\" the \"workaholic founders,\" and the \"sleepwalking robots.\" Instead, we should recognize that we are all operating on different levels of economic and psychological need."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "marks": [
                "strong"
              ],
              "text": "I'm curious to hear your take. Is \"extreme sacrifice\" ever justified for a vision, or has our culture gone too far? Let me know in the comments."
            }
          ]
        }
      ]
    },
    {
      "_type": "post",
      "title": "Did You Try Reading the Documentation?",
      "slug": {
        "_type": "slug",
        "current": "reading-documentation"
      },
      "publishedAt": "2023-03-04T14:02:00.000Z",
      "linkedinUrl": "https://www.linkedin.com/pulse/did-you-try-reading-documentation-tushar-laad",
      "body": [
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "marks": [
                "em"
              ],
              "text": "\"Did you try reading the documentation?\""
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "This is a question I've lately posed to many folks who have come to me with coding problems. When starting to code something new, it can be tempting to dive right in and start writing code without taking the time to read the documentation."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Now I am no saint. I added FastAPI to my tech stack last week. Initially, I gave in to the temptation of taking parts of code from random medium articles and trying to transform them into a solution to my problem. After spending 2 hours on millions of errors, I took out time to find the right documentation and read it to the letter. I was ready with an API in no time. I learned four important lessons from my experience:"
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Saves Time"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Reviewing the documentation before beginning to code can save you a significant amount of time in the long run. Documentation may help you avoid common mistakes and pitfalls by providing clear knowledge of utilizing a certain library or framework. This can help you get up to speed faster and start creating code straight away."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Fewer Errors; More Results"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "As you go through the documentation, you will not only get clear guidelines for producing error-free code, but you will also receive troubleshooting tips and examples of frequent problems, which will help you handle errors as they arise."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Better Understanding & Optimization"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "Documentation definitely gives you a better understanding of what the code is doing behind your back; this allows you to make more informed decisions when writing code and can help you optimize it for better performance. Furthermore, understanding the underlying principles of a library or framework might assist you in customizing the code to meet your needs."
            }
          ]
        },
        {
          "_type": "block",
          "style": "h3",
          "children": [
            {
              "_type": "span",
              "text": "Easier To Collaborate"
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "While committing or documenting your code, you can simply attach the documentation link; This can help ensure that everyone on the team is on the same page and that code is written consistently."
            }
          ]
        },
        {
          "_type": "block",
          "style": "normal",
          "children": [
            {
              "_type": "span",
              "text": "All in all, By taking the time to read the documentation, you can ensure that you are writing high-quality code that is efficient, effective, and easy to maintain. Therefore, it is highly recommended that developers prioritize reviewing the documentation before beginning to code."
            }
          ]
        }
      ]
    }
  ]
}